{
  "name": "Xhovani Mali",
  "label": "Graduate Student at NYU Tandon | Software & Hardware Engineer",
  "image_path": "img/default-image.png",

  "contact": {
    "location": "New York Metro Area"
  },

  "summary": "I've built a diverse engineering background by working across industries — from microcontrollers and FPGA design to aerospace, neuromorphic computing, and fintech. This breadth of experience reflects both curiosity and adaptability: I thrive at the intersection of software and hardware, where performance, reliability, and real-world impact meet.",

  "base_url": "https://xhovanim8.github.io/portfolio",

  "social_links": [
    {
      "label": "Personal Website",
      "url": "https://xhovanim8.github.io/portfolio",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/xhovanimali/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "GitHub",
      "url": "https://github.com/XhovaniM8",
      "svg_path": "img/github.svg"
    }
  ],

  "skills": {
    "languages": [
      "C/C++",
      "Python",
      "Verilog",
      "SystemVerilog",
      "VHDL",
      "Bash",
      "JavaScript"
    ],
    "systems": [
      "FPGA & RTL Design",
      "Embedded Systems",
      "RTOS",
      "Digital Signal Processing",
      "Computer Architecture",
      "Linux Systems Programming"
    ],
    "protocols": ["PCIe", "Ethernet", "AXI", "SPI", "I2C", "UART", "TCP/IP"],
    "tools": [
      "FPGA Development Tools",
      "RTL Simulation",
      "Docker",
      "Git",
      "Linux",
      "Web Frameworks"
    ],
    "frameworks": [
      "Neural Network Quantization",
      "PyTorch",
      "TensorFlow",
      "Hardware Acceleration Frameworks"
    ]
  },

  "work_experience": [
    {
      "company": "Neucom ApS",
      "position": "Digital Design Engineer (R&D)",
      "url": "https://neucom.ai/",
      "start_date": "2024",
      "end_date": "Present",
      "location": "Remote",
      "summary": "Designing and verifying digital pipelines for neuromorphic, event-based vision systems.",
      "highlights": [
        "Developed SystemVerilog RTL modules for event-based vision processing using spatio-temporal filtering techniques",
        "Created comprehensive simulation infrastructure using Verilator for hardware verification and visualization",
        "Built testbenches for timing verification and functional validation of digital processing pipelines",
        "Collaborated cross-functionally to ensure hardware-software co-design alignment"
      ]
    },
    {
      "company": "TTM Technologies",
      "position": "Software Engineering Intern",
      "url": "https://www.ttm.com/en",
      "start_date": "2024",
      "end_date": "2024",
      "location": "New York Metro Area",
      "summary": "Developed software and automation for mission-critical audio and communications systems.",
      "highlights": [
        "Built Python test automation frameworks for audio system validation and performance testing",
        "Developed web-based control interfaces using Flask for real-time system monitoring",
        "Created command-line tools for hardware configuration and register-level control",
        "Integrated automated testing into embedded firmware development workflows"
      ]
    },
    {
      "company": "Qynosys, Inc.",
      "position": "Electrical Engineer II Intern",
      "url": "https://qynosys.com/",
      "start_date": "2024",
      "end_date": "2024",
      "location": "New York, NY",
      "summary": "Contributed to R&D for high-performance networking and electronic systems.",
      "highlights": [
        "Deployed containerized network simulators using Docker and Linux for platform evaluation",
        "Ported RTL designs across multiple FPGA architectures focusing on hardware abstraction",
        "Performed PCIe interface characterization through loopback testing and performance analysis",
        "Worked with high-speed networking protocols and packet processing pipelines"
      ]
    },
    {
      "company": "Parallax AV Design Inc.",
      "position": "Audio-Visual Programming Engineer",
      "url": "https://www.parallaxav.com/",
      "start_date": "2022",
      "end_date": "2023",
      "location": "New York, NY",
      "summary": "Specialized in AV system integration, embedded control, and enterprise deployments.",
      "highlights": [
        "Programmed embedded control systems for enterprise audiovisual installations",
        "Integrated DSP platforms for multi-room audio processing and distribution",
        "Implemented networked AV-over-IP solutions for scalable system architectures",
        "Developed automation logic for user interface and system control"
      ]
    },
    {
      "company": "Microchip Technology Inc.",
      "position": "FPGA Engineer Intern",
      "url": "https://www.microchip.com/",
      "start_date": "2022",
      "end_date": "2022",
      "location": "New York Metro Area",
      "summary": "Worked on hardware validation, digital design, and FPGA-based communication interfaces.",
      "highlights": [
        "Designed SPI communication interfaces in Verilog RTL with self-checking testbenches",
        "Performed hardware validation on FPGA platforms for timing and functional verification",
        "Developed verification infrastructure for serial communication protocol testing",
        "Contributed to improving interface reliability for embedded system integration"
      ]
    },
    {
      "company": "Rio Tinto",
      "position": "Electrical Engineering Intern",
      "url": "https://www.riotinto.com/",
      "start_date": "2021",
      "end_date": "2021",
      "location": "US",
      "summary": "Supported electrical engineering projects at a large industrial site.",
      "highlights": [
        "Created technical documentation for motor control centers and instrumentation",
        "Developed wiring diagrams for RTD sensor installations and monitoring systems",
        "Gained experience with industrial automation systems and PLC configurations",
        "Supported plant maintenance teams with electrical system documentation"
      ]
    }
  ],

  "research_experience": [
    {
      "organization": "NYU Processor Design Team – VIP Program",
      "position": "Hardware Engineer",
      "location": "Brooklyn, NY",
      "start_date": "2024",
      "end_date": "2025",
      "summary": "Collaborated on modular RISC-V processor design, verification, and tooling as part of a vertically integrated project team.",
      "highlights": [
        "Designed RISC-V CPU modules in SystemVerilog including ALU and memory subsystems",
        "Performed RTL verification using Verilator and waveform analysis tools",
        "Contributed to CI/CD pipeline development for automated testing",
        "Collaborated on processor architecture documentation and design reviews"
      ]
    }
  ],

  "projects": [
    {
      "title": "FPGA-Accelerated Market Behavior Classifier",
      "summary": "Financial engineering capstone implementing a quantized LSTM model for real-time limit order book analysis on FPGA hardware.",
      "url": "https://github.com/XhovaniM8/fpga-orderbook-analysis",
      "duration": "2025 – Present",
      "highlights": [
        "Implemented quantized LSTM architecture using PyTorch and hardware-aware training techniques",
        "Deployed neural network to FPGA achieving microsecond-level inference latency",
        "Developed C++ market data simulator for generating training datasets",
        "Created hardware acceleration pipeline for real-time financial data processing"
      ]
    },
    {
      "title": "Digital Signal Processing Filter for Time-Series Forecasting",
      "summary": "Autoregressive forecasting system using Linear Predictive Coding (LPC) and Burg's algorithm on financial data.",
      "url": "https://github.com/XhovaniM8/Real-Time-Stock-Prediction-Filter",
      "duration": "2024",
      "highlights": [
        "Implemented LPC algorithms with Burg's method for time-series prediction",
        "Developed DSP filters for financial data preprocessing and feature extraction",
        "Created Python framework for backtesting and performance evaluation",
        "Optimized filter parameters for stability and prediction accuracy"
      ]
    },
    {
      "title": "Embedded Gesture Authentication System",
      "summary": "Real-time gesture-based authentication on an ARM Cortex-M microcontroller.",
      "url": "https://github.com/XhovaniM8/EmbeddedSentry",
      "duration": "2024",
      "highlights": [
        "Developed interrupt-driven firmware for IMU sensor data acquisition",
        "Implemented real-time signal processing for gesture feature extraction",
        "Created classification algorithms optimized for microcontroller constraints",
        "Designed low-power firmware architecture for battery-operated deployment"
      ]
    },
    {
      "title": "Enclosed Hydroponic Control System",
      "summary": "Closed-loop hydroponic system with sensor feedback and automated irrigation control.",
      "duration": "2021 – 2022",
      "highlights": [
        "Integrated multiple sensor types (pH, TDS, temperature) with microcontroller platform",
        "Developed control algorithms for automated pump and valve actuation",
        "Implemented digital filtering for sensor noise reduction",
        "Created fault detection and recovery mechanisms for system reliability"
      ]
    },
    {
      "title": "Vending Machine Controller (VHDL)",
      "summary": "FSM-based vending machine controller implemented on FPGA.",
      "duration": "2020",
      "highlights": [
        "Designed finite state machine architecture in VHDL for transaction processing",
        "Implemented coin validation and change calculation logic",
        "Performed RTL simulation and FPGA deployment",
        "Created comprehensive testbenches for edge case validation"
      ]
    },
    {
      "title": "X-Ray Fluorescence Analysis Utilities",
      "summary": "Utilities for processing and formatting XRF spectral data for analysis.",
      "duration": "2020",
      "highlights": [
        "Developed Python scripts for spectral data extraction and preprocessing",
        "Created data pipeline for format standardization and quality control",
        "Implemented collaborative development workflow using version control",
        "Built reusable analysis modules for research applications"
      ]
    }
  ],

  "education": [
    {
      "institution": "New York University",
      "location": "Brooklyn, NY",
      "url": "https://engineering.nyu.edu/",
      "degrees": ["M.S. in Computer Engineering"],
      "coursework": [
        "Real-Time Embedded Systems",
        "VLSI System Design",
        "Design & Analysis of Algorithms",
        "Machine Learning",
        "Digital Signal Processing"
      ],
      "graduation_date": "2025 (Expected)"
    },
    {
      "institution": "Farmingdale State College (SUNY)",
      "location": "New York",
      "url": "https://www.farmingdale.edu/",
      "degrees": ["B.S. in Computer Engineering Technologies"],
      "coursework": [
        "Digital Design",
        "Microprocessor Interfacing & Control",
        "Data Communications & Networking"
      ],
      "graduation_date": "2022"
    }
  ],

  "volunteer_experience": [
    {
      "organization": "Albanian Institute New York",
      "position": "Liaison",
      "url": "https://albanianinstitute.org",
      "start_date": "2022",
      "end_date": "Present",
      "summary": "Support cultural programming and community-facing initiatives.",
      "highlights": [
        "Assist with planning and execution of cultural and diplomatic events",
        "Represent the Institute at public programs and community gatherings",
        "Contribute to outreach and fundraising efforts for cultural initiatives"
      ]
    },
    {
      "organization": "Research Aligned Mentorship Program",
      "position": "Alumni Representative",
      "url": "https://www.farmingdale.edu",
      "start_date": "2021",
      "end_date": "2022",
      "summary": "Acted as an alumni liaison supporting first-generation and research-oriented students.",
      "highlights": [
        "Facilitated communication between program staff, scholars, and alumni",
        "Helped organize academic and social events for program participants",
        "Supported mentorship and networking opportunities for students"
      ]
    },
    {
      "organization": "SUNY SAIL – Global Leader Experience",
      "position": "Student Participant",
      "url": "https://www.farmingdale.edu",
      "start_date": "2019",
      "end_date": "2019",
      "summary": "Participated in a civic-focused leadership program with cross-cultural collaboration.",
      "highlights": [
        "Completed leadership curriculum focused on global civic engagement",
        "Collaborated with diverse student teams on applied projects",
        "Developed cross-cultural communication and teamwork skills"
      ]
    }
  ],

  "certifications": [
    {
      "name": "AVIXA AV Technologist",
      "issuer": "AVIXA",
      "year": 2022
    },
    {
      "name": "Tesira Core Concepts",
      "issuer": "Biamp",
      "year": 2022
    },
    {
      "name": "AV Networking Certification",
      "issuer": "Biamp",
      "year": 2022
    },
    {
      "name": "Foundations of User Experience (UX) Design",
      "issuer": "Google",
      "year": 2023
    },
    {
      "name": "Control Systems Programming",
      "issuer": "Crestron",
      "year": 2023
    }
  ],

  "awards": [
    {
      "name": "Poetry Award",
      "issuer": "Farmingdale State College",
      "year": 2021,
      "summary": "Recognized for creative writing exploring diversity and inclusion themes"
    },
    {
      "name": "Dean's / President's List",
      "issuer": "Farmingdale State College",
      "year": 2020,
      "summary": "Academic honors for sustained high performance during undergraduate studies"
    }
  ]
}
